Revit 2026 API

# PartResetFaceOffset Method

---

Resets the offset applied to the given part face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResetFaceOffset(
	Face face
)
```
```vb
Public Sub ResetFaceOffset (
	face As Face
)
```
```cpp
public:
void ResetFaceOffset(
	Face^ face
)
```
```fsharp
member ResetFaceOffset :
        face : Face -> unit
```

#### Parameters

face Face
     The face whose offset needs to be reset.

| Exception | Condition |
| --- | --- |
| ArgumentException | face does not belong to the part. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Part Class

Autodesk.Revit.DB Namespace